#!/usr/bin/env python
# encoding: utf-8
# author: hzhiping
# datetime: 2022/11/12 17:13

def list_operator():
    # 定义列表
    a = ['泠泠七弦上，', '静听松风寒。', '古调虽自爱，', '今人多不弹。']
    # 列表对象中的元素可以是不同的类型
    b = [12, "何当共剪西窗烛", 1.66, 5 + 3j]
    # 列表对象中的元素可以是另一个列表
    c = [12, "何当共剪西窗烛", 1.66, ["一夕轻雷落万丝", "霁光浮瓦碧参差", 3.66]]
    # 返回该元素的索引值
    e = c.index("何当共剪西窗烛")
    print(e)
    f = c.index(1.66)
    print(f)
    # 修改列表中的元素
    c[1] = "却话巴山夜雨时"
    print(c)
    # 在列表的第4个位置插入两个新元素
    d = [12, "何当共剪西窗烛", 1.66]
    d[3:] = ["却话巴山夜雨时", 1.12]  # '3:'表示从左侧数第4个位置开始添加新元素
    print(d)
    # 删除列表对象中的元素
    d = [12, "何当共剪西窗烛", 1.66]
    del d[2]
    print(d)
    # 从列表中删除最后一个元素
    d = [12, "何当共剪西窗烛", 1.66]
    del d[-1]
    print(d)
    # 一次清除所有的元素
    del d[:]
    print(d)
    # +号操作符经常用于字符串和列表元素的组合
    g = [1, 2, 3] + [4, 5, 6] + [7, 8, 9]
    print(g)
    h = ["苹果", "葡萄", "柚子", "桃子", "橙子"]
    h = "我最喜欢的水果是" + h[1]
    print(h)
    # *号运算符经常用于重复列表中的元素
    i = [100, 200, 300, 400] * 4
    print(i)
    # None是Python的内建值
    a = [None] * 10
    print(a)


if __name__ == '__main__':
    list_operator()
