#!/usr/bin/env python
# encoding: utf-8
# author: hzhiping
# datetime: 2022/11/12 18:18


def dictionary_operator():
    a = {"名称": "冰箱", "产地": "北京", "价格": "6500"}
    print(a)
    a = {"名称": "冰箱", "产地": "北京", "价格": "6500"}
    print(a["名称"])
    print(a["产地"])
    print(a["价格"])
    # 在获取字典中的元素值时，必须保证输入的键值在字典中是存在的，否则Python会产生一个KeyError错误
    # print(a["姓名"])
    # 字典中的元素值是可以修改的
    a["名称"] = "洗衣机"
    print(a)
    # del语句可以删除字典中的元素
    a = {"名称": "冰箱", "产地": "北京", "价格": "6500"}
    del a["名称"]
    print(a)
    # 不允许同一个键值多次出现，创建时如果同一个键值被赋值多次，那么只有最后一个值有效，前面重复的键值将会被自动删除
    d = {"名称": "冰箱", "产地": "北京", "价格": "6500", "产地": "上海", "价格": "8500"}
    print(d)
    # 字典键值必须不可变，所以可以用数字、字符串或元组充当，列表则不行，如果用列表做键值，将会报错
    # d = {["名称"]: "冰箱", "产地": "北京", "价格": "6500"}
    # print(d)


if __name__ == '__main__':
    dictionary_operator()
